<a href="https://colab.research.google.com/github/sgalsant/basedatos/blob/main/colab/tarea_consultas_world.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<h1>Consultas básicas SQL</h1>

## inicialización

In [ ]:
urlRepositorio = 'https://github.com/sgalsant/basedatos.git'
database = 'world'

dirDatabase = database #directorio dentro del repositorio en el que se encuentran los scripts de la base de datos

In [ ]:
#@title version de sqlalchemy compatible con magic %sql
#!pip install sqlalchemy==1.4.46 ipython-sql==0.4.1 #la verion de magic sql %sql no es compatible con la version 2.0 o superiores
import sqlalchemy
sqlalchemy.__version__ # doctest: +SKIP

'2.0.23'

In [ ]:
#@title descargar base de datos del repositorio

directory = '/content/' + database

!rm {directory} -r
!git clone {urlRepositorio} {directory}

if (dirDatabase == ""):
  pathDB = directory
else:
  pathDB = directory + "/" + dirDatabase

print ("los scripts de la base de datos están en: " + pathDB)

rm: cannot remove '/content/world': No such file or directory
Cloning into '/content/world'...
remote: Enumerating objects: 131, done.
remote: Counting objects: 100% (43/43), done.
remote: Compressing objects: 100% (39/39), done.
remote: Total 131 (delta 13), reused 1 (delta 1), pack-reused 88
Receiving objects: 100% (131/131), 3.02 MiB | 6.03 MiB/s, done.
Resolving deltas: 100% (34/34), done.
los scripts de la base de datos están en: /content/world/world

In [ ]:
#@title instalar mysql server con usuario "root" y contraseña "root"
%%shell
apt-get update > null
apt-get -y install mysql-server > null
/etc/init.d/mysql restart > null
service mysql status

su: warning: cannot change directory to /nonexistent: No such file or directory
 * /usr/bin/mysqladmin  Ver 8.0.35-0ubuntu0.22.04.1 for Linux on x86_64 ((Ubuntu))
Copyright (c) 2000, 2023, Oracle and/or its affiliates.

Oracle is a registered trademark of Oracle Corporation and/or its
affiliates. Other names may be trademarks of their respective
owners.

Server version		8.0.35-0ubuntu0.22.04.1
Protocol version	10
Connection		Localhost via UNIX socket
UNIX socket		/var/run/mysqld/mysqld.sock
Uptime:			2 sec

Threads: 2  Questions: 8  Slow queries: 0  Opens: 119  Flush tables: 3  Open tables: 38  Queries per second avg: 4.000

In [ ]:
#@title cargar base de datos y crear usuario "alumno" con permisos en esa base de datos

!echo -e "[client]\nuser = \"root\"\npassword = \"root\"\nhost = \"localhost\"" > config.cnf

print ("cargando " + pathDB + "/" + database +  ".sql")
!mysql --defaults-extra-file=config.cnf < {pathDB}/{database}.sql
!mysql --defaults-extra-file=config.cnf -e 'show databases; use {database}; show tables'

![ -f {pathDB}/{database}-data.sql ] && mysql --defaults-extra-file=config.cnf < {pathDB}/{database}-data.sql && echo "cargado datos"

!mysql --defaults-extra-file=config.cnf -e 'DROP USER IF EXISTS "alumno"@"localhost";CREATE USER "alumno"@"localhost" IDENTIFIED WITH mysql_native_password BY "alumno";GRANT ALL PRIVILEGES ON {database}.* TO "alumno"@"localhost";flush privileges;'

cargando /content/world/world/world.sql
+--------------------+
| Database           |
+--------------------+
| information_schema |
| mysql              |
| performance_schema |
| sys                |
| world              |
+--------------------+
+-----------------+
| Tables_in_world |
+-----------------+
| city            |
| country         |
| countrylanguage |
+-----------------+

In [ ]:
#@title conexión a la base de datos
!pip install pymysql

%env DATABASE_URL= mysql+pymysql://alumno:alumno@localhost/{database}
%reload_ext sql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 1.1 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0
env: DATABASE_URL=mysql+pymysql://alumno:alumno@localhost/world

##Consultar información de la base de datos

In [ ]:
#@title diagrama ER
from IPython.display import Image, display

import os
for file in os.listdir(pathDB):
    if file.endswith((".png", ".jpg")):
        print (file)
        display(Image(pathDB + '/' + file))

In [ ]:
#@title mostrar información de una tabla { run: "auto", vertical-output: true }
table_name = "country" #@param {type:"string"}
!mysqlshow {database} {table_name};

Database: world  Table: country
+----------------+---------------------------------------------------------------------------------------+--------------------+------+-----+---------+-------+---------------------------------+---------+
| Field          | Type                                                                                  | Collation          | Null | Key | Default | Extra | Privileges                      | Comment |
+----------------+---------------------------------------------------------------------------------------+--------------------+------+-----+---------+-------+---------------------------------+---------+
| Code           | char(3)                                                                               | utf8mb4_0900_ai_ci | NO   | PRI |         |       | select,insert,update,references |         |
| Name           | char(52)                                                                              | utf8mb4_0900_ai_ci | NO   |     |         |       | select,insert,update,references |         |
| Continent      | enum('Asia','Europe','North America','Africa','Oceania','Antarctica','South America') | utf8mb4_0900_ai_ci | NO   |     | Asia    |       | select,insert,update,references |         |
| Region         | char(26)                                                                              | utf8mb4_0900_ai_ci | NO   |     |         |       | select,insert,update,references |         |
| SurfaceArea    | decimal(10,2)                                                                         |                    | NO   |     | 0.00    |       | select,insert,update,references |         |
| IndepYear      | smallint                                                                              |                    | YES  |     |         |       | select,insert,update,references |         |
| Population     | int                                                                                   |                    | NO   |     | 0       |       | select,insert,update,references |         |
| LifeExpectancy | decimal(3,1)                                                                          |                    | YES  |     |         |       | select,insert,update,references |         |
| GNP            | decimal(10,2)                                                                         |                    | YES  |     |         |       | select,insert,update,references |         |
| GNPOld         | decimal(10,2)                                                                         |                    | YES  |     |         |       | select,insert,update,references |         |
| LocalName      | char(45)                                                                              | utf8mb4_0900_ai_ci | NO   |     |         |       | select,insert,update,references |         |
| GovernmentForm | char(45)                                                                              | utf8mb4_0900_ai_ci | NO   |     |         |       | select,insert,update,references |         |
| HeadOfState    | char(60)                                                                              | utf8mb4_0900_ai_ci | YES  |     |         |       | select,insert,update,references |         |
| Capital        | int                                                                                   |                    | YES  |     |         |       | select,insert,update,references |         |
| Code2          | char(2)                                                                               | utf8mb4_0900_ai_ci | NO   |     |         |       | select,insert,update,references |         |
+----------------+---------------------------------------------------------------------------------------+--------------------+------+-----+---------+-------+---------------------------------+---------+

## Ejercicios

🧑
## Sintaxis básica de una instrucción SQL

**select columnas**

**from tabla**

**where condicion**

**order by columna [asc|desc]**

Donde:
1. **select** indica la información a mostrar en el resultado. Se puede poner el nombre de varias columnas separadas por coma y usar * para indicar todas las columnas
2. **from** indica en que tabla se encuentra la información
3. **where** condición que debe cumplir los registros a incluir en el resultado. Por ejemplo, para incluir los países que no son de Europa ni de Africa la condición seria: continent != 'Europe' and continent != 'Africa'
4. **order by** indicamos el orden de los registros del resultado. El orden hace referencia a "ascendente" o "descendente". Se puede indicar varias columnas separadas por coma.

En esta tarea realizaremos consultas a la base de datos [world](https://dev.mysql.com/doc/world-setup/en/)

1. Tabla country: Información acerca de países

2. tabla city: Información de algunas ciudades de los países

3. tabla countrylanguage: Idiomas hablados en cada país

In [ ]:
#@title Ejercicio1: muestra todos los países

%%sql
select *
from country;

In [ ]:
#@title Ejercicio 2: mostrar el código (code), nombre (name) y continente (continent) de los países

%%sql
select code, name, continent
from country

In [ ]:
#@title Ejercicio 3: muestra el codigo, nombre y continente de los países ordenados por el nombre de país de forma alfabética
%%sql
select code, name, continent
from country
order by name asc;

In [ ]:
#@title Ejercicio 4: Muestra los países (codigo, nombre, continente y población (population)) ordenados de mayor a menor según su población
%%sql

In [ ]:
#@title Ejercicio 5: Muestra los países (codigo, nombre y continente) ordenados alfabeticamente por el nombre del continente y nombre de país
%%sql

🧑
#limit
Se puede indicar cuantos registros queremos incluir en el resultado usando la directiva "limit". Por ejemplo, para mostrar solo 10 países.

select *

from country

limit 10;

In [ ]:
#@title Ejercicio 6: Muestra sólo los primeros 10 países (codigo, nombre, continente y población (population)) ordenados de mayor a menor según su población
%%sql
select code, name, continent, population
from country
order by population desc
limit 10

In [ ]:
#@title Ejercicio 7: Muestra los 10 países con menos población
%%sql

 * mysql+pymysql://alumno:***@localhost/world
10 rows affected.

[('SGS', 'South Georgia and the South Sandwich Islands', 'Antarctica', 0),
 ('ATF', 'French Southern territories', 'Antarctica', 0),
 ('BVT', 'Bouvet Island', 'Antarctica', 0),
 ('IOT', 'British Indian Ocean Territory', 'Africa', 0),
 ('ATA', 'Antarctica', 'Antarctica', 0),
 ('UMI', 'United States Minor Outlying Islands', 'Oceania', 0),
 ('HMD', 'Heard Island and McDonald Islands', 'Antarctica', 0),
 ('PCN', 'Pitcairn', 'Oceania', 50),
 ('CCK', 'Cocos (Keeling) Islands', 'Oceania', 600),
 ('VAT', 'Holy See (Vatican City State)', 'Europe', 1000)]

🧑
#Where
Con el where podemos filtrar los registros que queremos incluir en el resultado de la consulta. La condición puede ser todo lo complicada que queremos usando operadores aritméticos (+, -, *, /, %), operadores de comparación (=, !=, <, >, <=, >=), concatenando condiciones con operadores lógicos and / or

In [ ]:
#@title Ejercicio 8: Muestra todos los países de Asia (código, nombre y población), ordenados de mayor a menor según la población
%%sql
select code, name, population
from country
where continent = 'Asia'
order by population desc

In [ ]:
#@title Ejercicio 9: Muestra todos los datos registrados de España
%%sql

 * mysql+pymysql://alumno:***@localhost/world
1 rows affected.

[('ESP', 'Spain', 'Europe', 'Southern Europe', Decimal('505992.00'), 1492, 39441700, Decimal('78.8'), Decimal('553233.00'), Decimal('532031.00'), 'España', 'Constitutional Monarchy', 'Juan Carlos I', 653, 'ES')]

In [ ]:
#@title Ejercicio 10: Muestra todos los datos del país más poblado de Africa
%%sql

 * mysql+pymysql://alumno:***@localhost/world
1 rows affected.

[('NGA', 'Nigeria', 'Africa', 'Western Africa', Decimal('923768.00'), 1960, 111506000, Decimal('51.6'), Decimal('65707.00'), Decimal('58623.00'), 'Nigeria', 'Federal Republic', 'Olusegun Obasanjo', 2754, 'NG')]

In [ ]:
#@title Ejercicio 11: Muestra todos los países de Asia (código, nombre y población), ordenados de mayor a menor según la población cuya población sea mayor que 100.000.000
%%sql

 * mysql+pymysql://alumno:***@localhost/world
6 rows affected.

[('CHN', 'China', 1277558000),
 ('IND', 'India', 1013662000),
 ('IDN', 'Indonesia', 212107000),
 ('PAK', 'Pakistan', 156483000),
 ('BGD', 'Bangladesh', 129155000),
 ('JPN', 'Japan', 126714000)]

In [ ]:
#@title Ejercicio 12: Muestra todos los países (código, nombre y población), ordenados de mayor a menor según la población cuya población se encuentre entre 15 y 35 millones
%%sql
select code, name, population
from country
where population between 15000000 and 35000000
order by population desc

In [ ]:
#@title Ejercicio 13: Muestra todos los países de Asia y África (código, nombre, continente y población), ordenados de mayor a menor según la población cuya población sea mayor de 50 millones
%%sql

 * mysql+pymysql://alumno:***@localhost/world
15 rows affected.

[('CHN', 'China', 'Asia', 1277558000),
 ('IND', 'India', 'Asia', 1013662000),
 ('IDN', 'Indonesia', 'Asia', 212107000),
 ('PAK', 'Pakistan', 'Asia', 156483000),
 ('BGD', 'Bangladesh', 'Asia', 129155000),
 ('JPN', 'Japan', 'Asia', 126714000),
 ('NGA', 'Nigeria', 'Africa', 111506000),
 ('VNM', 'Vietnam', 'Asia', 79832000),
 ('PHL', 'Philippines', 'Asia', 75967000),
 ('EGY', 'Egypt', 'Africa', 68470000),
 ('IRN', 'Iran', 'Asia', 67702000),
 ('TUR', 'Turkey', 'Asia', 66591000),
 ('ETH', 'Ethiopia', 'Africa', 62565000),
 ('THA', 'Thailand', 'Asia', 61399000),
 ('COD', 'Congo, The Democratic Republic of the', 'Africa', 51654000)]

In [ ]:
#@title Ejercicio 14: Muestra los 10 países más poblados que no sean de Asia ni de Africa
%%sql

 * mysql+pymysql://alumno:***@localhost/world
10 rows affected.

[('USA', 'United States', 'North America'),
 ('BRA', 'Brazil', 'South America'),
 ('RUS', 'Russian Federation', 'Europe'),
 ('MEX', 'Mexico', 'North America'),
 ('DEU', 'Germany', 'Europe'),
 ('GBR', 'United Kingdom', 'Europe'),
 ('FRA', 'France', 'Europe'),
 ('ITA', 'Italy', 'Europe'),
 ('UKR', 'Ukraine', 'Europe'),
 ('COL', 'Colombia', 'South America')]

🧑
# In
Podemos indicar que un valor se encuentra en una lista usando el operador "in". Por ejemplo, columnaX in (0, 1, 2, 3) incluira todos los registros cuya columnaX tenga uno de los valores indicados 0, 1, 2, 3.

In [ ]:
#@title Ejercicio 15: Usando el operador "in", muestra todos los países de Asia, África y Europa(código, nombre, continente y población), ordenados de mayor a menor según la población cuya población sea mayor de 50 millones
%%sql
select code, name, continent, population
from country
where continent in ('Asia', 'Africa', 'Europe') and population > 50000000
order by population desc

In [ ]:
#@title Ejercicio 16: Usando el operador "not in", muestra todos los países que no sean de Asia, África y Europa(código, nombre, continente y población), ordenados de mayor a menor según la población cuya población sea mayor de 50 millones
%%sql

3 rows affected.

[('USA', 'United States', 'North America', 278357000),
 ('BRA', 'Brazil', 'South America', 170115000),
 ('MEX', 'Mexico', 'North America', 98881000)]

🧑
# LIKE
El operador like nos permite realizar condiciones avanzadas sobre columnas de texto. Por ejemplo:
1. Todos los nombres que empiezan por A --> name like 'A%'
2. Todos los nombres que finalizan en A --> name like '%A'
3. Todos los nombres que contengan una A --> name like '%A%'
4. Todos los nombre cuya segunda letra sea una A --> name like '_A%'

% Indica cualquier número de carácters
_ Indica un carácter cualquiera

Esto forma parte del estándar SQL, luego cada sistema gestor de bases de datos puede incluir mayor o menor soporte a expresiones regulares. Por ejemplo, para Mysql puede consultar está [página](https://dev.mysql.com/doc/refman/8.0/en/pattern-matching.html)

In [ ]:
#@title Ejercicio 17: Muestra todos países cuyo nombre empieza por la letra U
%%sql
select code, name, continent
from country
where name like 'u%'

In [ ]:
#@title Ejercicio 18: Muestra todos los países cuyo nombre finaliza por la letra S
%%sql
select code, name, continent
from country
where name like '%s'

In [ ]:
#@title Ejercicio 19: Muestra todos los países cuyo nombre empieza con U y finaliza con S
%%sql
select code, name, continent
from country
where name like 'u%s'

In [ ]:
#@title Ejercicio 20: Muestra todos los países cuyo nombre empieza contenga una A en la tercera letra
%%sql
select code, name, continent
from country
where name like '__A%'

In [ ]:
#@title Ejercicio 21: Muestra las ciudades cuyo nombre comienzan en 'P', el distrito contiene 'er' y el código de país tiene la segunda letra 'A'
%%sql

 * mysql+pymysql://alumno:***@localhost/world
3 rows affected.

[(715, 'Port Elizabeth', 'ZAF', 'Eastern Cape', 752319),
 (750, 'Paarl', 'ZAF', 'Western Cape', 105768),
 (2829, 'Peshawar', 'PAK', 'Nothwest Border Prov', 988005)]

🧑
#distinct
Con este operador podemos indicar que no muestre valores duplicados en el resultado de la consulta. Por ejemplo, para mostrar los nombres sin repeticiones

select distinct(name)

from country

In [ ]:
#@title Ejercicio 22: Muestra todos los continentes sin repeticiones y ordenados alfábeticamente
%%sql
select distinct(continent)
from country
ORDER BY CAST(continent AS CHAR) asc; -- se debe convertir a char ya que continente es un enumerado

In [ ]:
#@title Ejercicio 23: Muestra todas las lenguas sin repeticiones (tabla countrylanguage) que se hablan en los países cuyo código comienza por A ordenados alfabeticamente según el idioma (language)
%%sql

 * mysql+pymysql://alumno:***@localhost/world
45 rows affected.

[('Albaniana',),
 ('Ambo',),
 ('Arabic',),
 ('Armenian',),
 ('Azerbaijani',),
 ('Balochi',),
 ('Canton Chinese',),
 ('Catalan',),
 ('Chokwe',),
 ('Creole English',),
 ('Czech',),
 ('Dari',),
 ('Dutch',),
 ('English',),
 ('French',),
 ('German',),
 ('Greek',),
 ('Hindi',),
 ('Hungarian',),
 ('Indian Languages',),
 ('Italian',),
 ('Kongo',),
 ('Lezgian',),
 ('Luchazi',),
 ('Luimbe-nganguela',),
 ('Luvale',),
 ('Macedonian',),
 ('Mbundu',),
 ('Nyaneka-nkhumbi',),
 ('Ovimbundu',),
 ('Papiamento',),
 ('Pashto',),
 ('Polish',),
 ('Portuguese',),
 ('Romanian',),
 ('Russian',),
 ('Samoan',),
 ('Serbo-Croatian',),
 ('Slovene',),
 ('Spanish',),
 ('Tongan',),
 ('Turkish',),
 ('Turkmenian',),
 ('Uzbek',),
 ('Vietnamese',)]

🧑
# Funciones de agregados
1. Count
2. Sum
3. Min
4. Max
5. Avg

In [ ]:
#@title Ejercicio 24: Mostrar el número de países
%%sql
select count(*)
from country

In [ ]:
#@title Ejercicio 25: Mostrar el número de continentes diferentes que se incluye en la tabla de países
%%sql
select count(distinct(continent))
from country

In [ ]:
#@title Ejercicio 26: Consultando la tabla 'city', muestra el número de distritos (district) de España
%%sql

 * mysql+pymysql://alumno:***@localhost/world
1 rows affected.

[(17,)]

In [ ]:
#@title Ejercicio 27: Mostrar la suma todal de población de todos los países
%%sql
select sum(population)
from country

In [ ]:
#@title Ejercicio 28: Mostrar la población mínima de un país de Asia
%%sql
select  min(population)
from country
where continent = 'Asia'

In [ ]:
#@title Ejercicio 29: Usando la función "max", muestra la población máxima de un país de Europa
%%sql

 * mysql+pymysql://alumno:***@localhost/world
1 rows affected.

[(146934000,)]

In [ ]:
#@title Ejercicio 30: Mostrar la población media de los países europeos
%%sql
select  avg(population)
from country
where continent = 'Europe'

In [ ]:
#@title Ejercicio 31: Uso de alias
%%sql
select count(*) as total
from country

 * mysql+pymysql://alumno:***@localhost/world
1 rows affected.

[(239,)]

In [ ]:
#@title Ejercicio 32: En relación al continente asiático, muestra la población total (alias total), la menor población (alias menor) y mayor población (alias mayor) de un país y la media de las poblaciones de sus países (alias media)
%%sql